#ifndef __DUAL_BOARD_TRANSMIT_H__
#define __DUAL_BOARD_TRANSMIT_H__

#include "main.h"
#include "APP_Config.h"
#include "A_MCommon.h"

#if(BOARD_MODE == BOARD_MODE_DUAL)

//** #################################################################################################### **//
//** ========================================== 宏定义 ================================================== **//
//** #################################################################################################### **//

//双板通信任务系统循环时间
#define DUAL_BOARD_TRANSMIT_TASK_TIME_MS 1

#define GIMBAL_BOARD		1       //云台板
#define CHASSIS_BOARD	2       //地盘板

#define BOARD_ID      GIMBAL_BOARD       //云台板、地盘板

#define TX_BASE_ID ((BOARD_ID == 1) ? 0x100 : 0x200)  /* 发送基ID */
#define RX_BASE_ID ((BOARD_ID == 1) ? 0x200 : 0x100)  /* 接收基ID */

//** #################################################################################################### **//
//** ======================================== 枚举、结构体 =============================================== **//
//** #################################################################################################### **//

typedef struct{

    //要发送的东西
    struct{
        CMD_t CMD;
    }Tx;

    //要接受的东西
    struct{
        CMD_t CMD;
    }Rx;

}Dual_Board_Transmit_t;

#endif

#endif /* __DUAL_BOARD_TRANSMIT_H__ */
